
       //---------------------------------------------------颜色设定-----------------------//
         var rollcolor_red='#056fa1';
         var rollcolor_green='#f00';
         var rollcolor_yellow='#e45626';
         var rollcolor_purple='#89c42e';


         var color_red="#ff5003";
         var color_green="#71ba2d";
         var color_yellow="#fed30d";
         var color_purple="#cc67db";

            //-------------------------------------------------------------------//
            var map;
            var continentsDataProvider;
            var backIconSVG = "M16,1.466C7.973,1.466,1.466,7.973,1.466,16c0,8.027,6.507,14.534,14.534,14.534c8.027,0,14.534-6.507,14.534-14.534C30.534,7.973,24.027,1.466,16,1.466zM27.436,17.39c0.001,0.002,0.004,0.002,0.005,0.004c-0.022,0.187-0.054,0.37-0.085,0.554c-0.015-0.012-0.034-0.025-0.047-0.036c-0.103-0.09-0.254-0.128-0.318-0.115c-0.157,0.032,0.229,0.305,0.267,0.342c0.009,0.009,0.031,0.03,0.062,0.058c-1.029,5.312-5.709,9.338-11.319,9.338c-4.123,0-7.736-2.18-9.776-5.441c0.123-0.016,0.24-0.016,0.28-0.076c0.051-0.077,0.102-0.241,0.178-0.331c0.077-0.089,0.165-0.229,0.127-0.292c-0.039-0.064,0.101-0.344,0.088-0.419c-0.013-0.076-0.127-0.256,0.064-0.407s0.394-0.382,0.407-0.444c0.012-0.063,0.166-0.331,0.152-0.458c-0.012-0.127-0.152-0.28-0.24-0.318c-0.09-0.037-0.28-0.05-0.356-0.151c-0.077-0.103-0.292-0.203-0.368-0.178c-0.076,0.025-0.204,0.05-0.305-0.015c-0.102-0.062-0.267-0.139-0.33-0.189c-0.065-0.05-0.229-0.088-0.305-0.088c-0.077,0-0.065-0.052-0.178,0.101c-0.114,0.153,0,0.204-0.204,0.177c-0.204-0.023,0.025-0.036,0.141-0.189c0.113-0.152-0.013-0.242-0.141-0.203c-0.126,0.038-0.038,0.115-0.241,0.153c-0.203,0.036-0.203-0.09-0.076-0.115s0.355-0.139,0.355-0.19c0-0.051-0.025-0.191-0.127-0.191s-0.077-0.126-0.229-0.291c-0.092-0.101-0.196-0.164-0.299-0.204c-0.09-0.579-0.15-1.167-0.15-1.771c0-2.844,1.039-5.446,2.751-7.458c0.024-0.02,0.048-0.034,0.069-0.036c0.084-0.009,0.31-0.025,0.51-0.059c0.202-0.034,0.418-0.161,0.489-0.153c0.069,0.008,0.241,0.008,0.186-0.042C8.417,8.2,8.339,8.082,8.223,8.082S8.215,7.896,8.246,7.896c0.03,0,0.186,0.025,0.178,0.11C8.417,8.091,8.471,8.2,8.625,8.167c0.156-0.034,0.132-0.162,0.102-0.195C8.695,7.938,8.672,7.853,8.642,7.794c-0.031-0.06-0.023-0.136,0.14-0.153C8.944,7.625,9.168,7.708,9.16,7.573s0-0.28,0.046-0.356C9.253,7.142,9.354,7.09,9.299,7.065C9.246,7.04,9.176,7.099,9.121,6.972c-0.054-0.127,0.047-0.22,0.108-0.271c0.02-0.015,0.067-0.06,0.124-0.112C11.234,5.257,13.524,4.466,16,4.466c3.213,0,6.122,1.323,8.214,3.45c-0.008,0.022-0.01,0.052-0.031,0.056c-0.077,0.013-0.166,0.063-0.179-0.051c-0.013-0.114-0.013-0.331-0.102-0.203c-0.089,0.127-0.127,0.127-0.127,0.191c0,0.063,0.076,0.127,0.051,0.241C23.8,8.264,23.8,8.341,23.84,8.341c0.036,0,0.126-0.115,0.239-0.141c0.116-0.025,0.319-0.088,0.332,0.026c0.013,0.115,0.139,0.152,0.013,0.203c-0.128,0.051-0.267,0.026-0.293-0.051c-0.025-0.077-0.114-0.077-0.203-0.013c-0.088,0.063-0.279,0.292-0.279,0.292s-0.306,0.139-0.343,0.114c-0.04-0.025,0.101-0.165,0.203-0.228c0.102-0.064,0.178-0.204,0.14-0.242c-0.038-0.038-0.088-0.279-0.063-0.343c0.025-0.063,0.139-0.152,0.013-0.216c-0.127-0.063-0.217-0.14-0.318-0.178s-0.216,0.152-0.305,0.204c-0.089,0.051-0.076,0.114-0.191,0.127c-0.114,0.013-0.189,0.165,0,0.254c0.191,0.089,0.255,0.152,0.204,0.204c-0.051,0.051-0.267-0.025-0.267-0.025s-0.165-0.076-0.268-0.076c-0.101,0-0.229-0.063-0.33-0.076c-0.102-0.013-0.306-0.013-0.355,0.038c-0.051,0.051-0.179,0.203-0.28,0.152c-0.101-0.051-0.101-0.102-0.241-0.051c-0.14,0.051-0.279-0.038-0.355,0.038c-0.077,0.076-0.013,0.076-0.255,0c-0.241-0.076-0.189,0.051-0.419,0.089s-0.368-0.038-0.432,0.038c-0.064,0.077-0.153,0.217-0.19,0.127c-0.038-0.088,0.126-0.241,0.062-0.292c-0.062-0.051-0.33-0.025-0.367,0.013c-0.039,0.038-0.014,0.178,0.011,0.229c0.026,0.05,0.064,0.254-0.011,0.216c-0.077-0.038-0.064-0.166-0.141-0.152c-0.076,0.013-0.165,0.051-0.203,0.077c-0.038,0.025-0.191,0.025-0.229,0.076c-0.037,0.051,0.014,0.191-0.051,0.203c-0.063,0.013-0.114,0.064-0.254-0.025c-0.14-0.089-0.14-0.038-0.178-0.012c-0.038,0.025-0.216,0.127-0.229,0.012c-0.013-0.114,0.025-0.152-0.089-0.229c-0.115-0.076-0.026-0.076,0.127-0.025c0.152,0.05,0.343,0.075,0.622-0.013c0.28-0.089,0.395-0.127,0.28-0.178c-0.115-0.05-0.229-0.101-0.406-0.127c-0.179-0.025-0.42-0.025-0.7-0.127c-0.279-0.102-0.343-0.14-0.457-0.165c-0.115-0.026-0.813-0.14-1.132-0.089c-0.317,0.051-1.193,0.28-1.245,0.318s-0.128,0.19-0.292,0.318c-0.165,0.127-0.47,0.419-0.712,0.47c-0.241,0.051-0.521,0.254-0.521,0.305c0,0.051,0.101,0.242,0.076,0.28c-0.025,0.038,0.05,0.229,0.191,0.28c0.139,0.05,0.381,0.038,0.393-0.039c0.014-0.076,0.204-0.241,0.217-0.127c0.013,0.115,0.14,0.292,0.114,0.368c-0.025,0.077,0,0.153,0.09,0.14c0.088-0.012,0.559-0.114,0.559-0.114s0.153-0.064,0.127-0.166c-0.026-0.101,0.166-0.241,0.203-0.279c0.038-0.038,0.178-0.191,0.014-0.241c-0.167-0.051-0.293-0.064-0.115-0.216s0.292,0,0.521-0.229c0.229-0.229-0.051-0.292,0.191-0.305c0.241-0.013,0.496-0.025,0.444,0.051c-0.05,0.076-0.342,0.242-0.508,0.318c-0.166,0.077-0.14,0.216-0.076,0.292c0.063,0.076,0.09,0.254,0.204,0.229c0.113-0.025,0.254-0.114,0.38-0.101c0.128,0.012,0.383-0.013,0.42-0.013c0.039,0,0.216,0.178,0.114,0.203c-0.101,0.025-0.229,0.013-0.445,0.025c-0.215,0.013-0.456,0.013-0.456,0.051c0,0.039,0.292,0.127,0.19,0.191c-0.102,0.063-0.203-0.013-0.331-0.026c-0.127-0.012-0.203,0.166-0.241,0.267c-0.039,0.102,0.063,0.28-0.127,0.216c-0.191-0.063-0.331-0.063-0.381-0.038c-0.051,0.025-0.203,0.076-0.331,0.114c-0.126,0.038-0.076-0.063-0.242-0.063c-0.164,0-0.164,0-0.164,0l-0.103,0.013c0,0-0.101-0.063-0.114-0.165c-0.013-0.102,0.05-0.216-0.013-0.241c-0.064-0.026-0.292,0.012-0.33,0.088c-0.038,0.076-0.077,0.216-0.026,0.28c0.052,0.063,0.204,0.19,0.064,0.152c-0.14-0.038-0.317-0.051-0.419,0.026c-0.101,0.076-0.279,0.241-0.279,0.241s-0.318,0.025-0.318,0.102c0,0.077,0,0.178-0.114,0.191c-0.115,0.013-0.268,0.05-0.42,0.076c-0.153,0.025-0.139,0.088-0.317,0.102s-0.204,0.089-0.038,0.114c0.165,0.025,0.418,0.127,0.431,0.241c0.014,0.114-0.013,0.242-0.076,0.356c-0.043,0.079-0.305,0.026-0.458,0.026c-0.152,0-0.456-0.051-0.584,0c-0.127,0.051-0.102,0.305-0.064,0.419c0.039,0.114-0.012,0.178-0.063,0.216c-0.051,0.038-0.065,0.152,0,0.204c0.063,0.051,0.114,0.165,0.166,0.178c0.051,0.013,0.215-0.038,0.279,0.025c0.064,0.064,0.127,0.216,0.165,0.178c0.039-0.038,0.089-0.203,0.153-0.166c0.064,0.039,0.216-0.012,0.331-0.025s0.177-0.14,0.292-0.204c0.114-0.063,0.05-0.063,0.013-0.14c-0.038-0.076,0.114-0.165,0.204-0.254c0.088-0.089,0.253-0.013,0.292-0.115c0.038-0.102,0.051-0.279,0.151-0.267c0.103,0.013,0.243,0.076,0.331,0.076c0.089,0,0.279-0.14,0.332-0.165c0.05-0.025,0.241-0.013,0.267,0.102c0.025,0.114,0.241,0.254,0.292,0.279c0.051,0.025,0.381,0.127,0.433,0.165c0.05,0.038,0.126,0.153,0.152,0.254c0.025,0.102,0.114,0.102,0.128,0.013c0.012-0.089-0.065-0.254,0.025-0.242c0.088,0.013,0.191-0.026,0.191-0.026s-0.243-0.165-0.331-0.203c-0.088-0.038-0.255-0.114-0.331-0.241c-0.076-0.127-0.267-0.153-0.254-0.279c0.013-0.127,0.191-0.051,0.292,0.051c0.102,0.102,0.356,0.241,0.445,0.33c0.088,0.089,0.229,0.127,0.267,0.242c0.039,0.114,0.152,0.241,0.19,0.292c0.038,0.051,0.165,0.331,0.204,0.394c0.038,0.063,0.165-0.012,0.229-0.063c0.063-0.051,0.179-0.076,0.191-0.178c0.013-0.102-0.153-0.178-0.203-0.216c-0.051-0.038,0.127-0.076,0.191-0.127c0.063-0.05,0.177-0.14,0.228-0.063c0.051,0.077,0.026,0.381,0.051,0.432c0.025,0.051,0.279,0.127,0.331,0.191c0.05,0.063,0.267,0.089,0.304,0.051c0.039-0.038,0.242,0.026,0.294,0.038c0.049,0.013,0.202-0.025,0.304-0.05c0.103-0.025,0.204-0.102,0.191,0.063c-0.013,0.165-0.051,0.419-0.179,0.546c-0.127,0.127-0.076,0.191-0.202,0.191c-0.06,0-0.113,0-0.156,0.021c-0.041-0.065-0.098-0.117-0.175-0.097c-0.152,0.038-0.344,0.038-0.47,0.19c-0.128,0.153-0.178,0.165-0.204,0.114c-0.025-0.051,0.369-0.267,0.317-0.331c-0.05-0.063-0.355-0.038-0.521-0.038c-0.166,0-0.305-0.102-0.433-0.127c-0.126-0.025-0.292,0.127-0.418,0.254c-0.128,0.127-0.216,0.038-0.331,0.038c-0.115,0-0.331-0.165-0.331-0.165s-0.216-0.089-0.305-0.089c-0.088,0-0.267-0.165-0.318-0.165c-0.05,0-0.19-0.115-0.088-0.166c0.101-0.05,0.202,0.051,0.101-0.229c-0.101-0.279-0.33-0.216-0.419-0.178c-0.088,0.039-0.724,0.025-0.775,0.025c-0.051,0-0.419,0.127-0.533,0.178c-0.116,0.051-0.318,0.115-0.369,0.14c-0.051,0.025-0.318-0.051-0.433,0.013c-0.151,0.084-0.291,0.216-0.33,0.216c-0.038,0-0.153,0.089-0.229,0.28c-0.077,0.19,0.013,0.355-0.128,0.419c-0.139,0.063-0.394,0.204-0.495,0.305c-0.102,0.101-0.229,0.458-0.355,0.623c-0.127,0.165,0,0.317,0.025,0.419c0.025,0.101,0.114,0.292-0.025,0.471c-0.14,0.178-0.127,0.266-0.191,0.279c-0.063,0.013,0.063,0.063,0.088,0.19c0.025,0.128-0.114,0.255,0.128,0.369c0.241,0.113,0.355,0.217,0.418,0.367c0.064,0.153,0.382,0.407,0.382,0.407s0.229,0.205,0.344,0.293c0.114,0.089,0.152,0.038,0.177-0.05c0.025-0.09,0.178-0.104,0.355-0.104c0.178,0,0.305,0.04,0.483,0.014c0.178-0.025,0.356-0.141,0.42-0.166c0.063-0.025,0.279-0.164,0.443-0.063c0.166,0.103,0.141,0.241,0.23,0.332c0.088,0.088,0.24,0.037,0.355-0.051c0.114-0.09,0.064-0.052,0.203,0.025c0.14,0.075,0.204,0.151,0.077,0.267c-0.128,0.113-0.051,0.293-0.128,0.47c-0.076,0.178-0.063,0.203,0.077,0.278c0.14,0.076,0.394,0.548,0.47,0.638c0.077,0.088-0.025,0.342,0.064,0.495c0.089,0.151,0.178,0.254,0.077,0.331c-0.103,0.075-0.28,0.216-0.292,0.47s0.051,0.431,0.102,0.521s0.177,0.331,0.241,0.419c0.064,0.089,0.14,0.305,0.152,0.445c0.013,0.14-0.024,0.306,0.039,0.381c0.064,0.076,0.102,0.191,0.216,0.292c0.115,0.103,0.152,0.318,0.152,0.318s0.039,0.089,0.051,0.229c0.012,0.14,0.025,0.228,0.152,0.292c0.126,0.063,0.215,0.076,0.28,0.013c0.063-0.063,0.381-0.077,0.546-0.063c0.165,0.013,0.355-0.075,0.521-0.19s0.407-0.419,0.496-0.508c0.089-0.09,0.292-0.255,0.268-0.356c-0.025-0.101-0.077-0.203,0.024-0.254c0.102-0.052,0.344-0.152,0.356-0.229c0.013-0.077-0.09-0.395-0.115-0.457c-0.024-0.064,0.064-0.18,0.165-0.306c0.103-0.128,0.421-0.216,0.471-0.267c0.051-0.053,0.191-0.267,0.217-0.433c0.024-0.167-0.051-0.369,0-0.457c0.05-0.09,0.013-0.165-0.103-0.268c-0.114-0.102-0.089-0.407-0.127-0.457c-0.037-0.051-0.013-0.319,0.063-0.345c0.076-0.023,0.242-0.279,0.344-0.393c0.102-0.114,0.394-0.47,0.534-0.496c0.139-0.025,0.355-0.229,0.368-0.343c0.013-0.115,0.38-0.547,0.394-0.635c0.013-0.09,0.166-0.42,0.102-0.497c-0.062-0.076-0.559,0.115-0.622,0.141c-0.064,0.025-0.241,0.127-0.446,0.113c-0.202-0.013-0.114-0.177-0.127-0.254c-0.012-0.076-0.228-0.368-0.279-0.381c-0.051-0.012-0.203-0.166-0.267-0.317c-0.063-0.153-0.152-0.343-0.254-0.458c-0.102-0.114-0.165-0.38-0.268-0.559c-0.101-0.178-0.189-0.407-0.279-0.572c-0.021-0.041-0.045-0.079-0.067-0.117c0.118-0.029,0.289-0.082,0.31-0.009c0.024,0.088,0.165,0.279,0.19,0.419s0.165,0.089,0.178,0.216c0.014,0.128,0.14,0.433,0.19,0.47c0.052,0.038,0.28,0.242,0.318,0.318c0.038,0.076,0.089,0.178,0.127,0.369c0.038,0.19,0.076,0.444,0.179,0.482c0.102,0.038,0.444-0.064,0.508-0.102s0.482-0.242,0.635-0.255c0.153-0.012,0.179-0.115,0.368-0.152c0.191-0.038,0.331-0.177,0.458-0.28c0.127-0.101,0.28-0.355,0.33-0.444c0.052-0.088,0.179-0.152,0.115-0.253c-0.063-0.103-0.331-0.254-0.433-0.268c-0.102-0.012-0.089-0.178-0.152-0.178s-0.051,0.088-0.178,0.153c-0.127,0.063-0.255,0.19-0.344,0.165s0.026-0.089-0.113-0.203s-0.192-0.14-0.192-0.228c0-0.089-0.278-0.255-0.304-0.382c-0.026-0.127,0.19-0.305,0.254-0.19c0.063,0.114,0.115,0.292,0.279,0.368c0.165,0.076,0.318,0.204,0.395,0.229c0.076,0.025,0.267-0.14,0.33-0.114c0.063,0.024,0.191,0.253,0.306,0.292c0.113,0.038,0.495,0.051,0.559,0.051s0.33,0.013,0.381-0.063c0.051-0.076,0.089-0.076,0.153-0.076c0.062,0,0.177,0.229,0.267,0.254c0.089,0.025,0.254,0.013,0.241,0.179c-0.012,0.164,0.076,0.305,0.165,0.317c0.09,0.012,0.293-0.191,0.293-0.191s0,0.318-0.012,0.433c-0.014,0.113,0.139,0.534,0.139,0.534s0.19,0.393,0.241,0.482s0.267,0.355,0.267,0.47c0,0.115,0.025,0.293,0.103,0.293c0.076,0,0.152-0.203,0.24-0.331c0.091-0.126,0.116-0.305,0.153-0.432c0.038-0.127,0.038-0.356,0.038-0.444c0-0.09,0.075-0.166,0.255-0.242c0.178-0.076,0.304-0.292,0.456-0.407c0.153-0.115,0.141-0.305,0.446-0.305c0.305,0,0.278,0,0.355-0.077c0.076-0.076,0.151-0.127,0.19,0.013c0.038,0.14,0.254,0.343,0.292,0.394c0.038,0.052,0.114,0.191,0.103,0.344c-0.013,0.152,0.012,0.33,0.075,0.33s0.191-0.216,0.191-0.216s0.279-0.189,0.267,0.013c-0.014,0.203,0.025,0.419,0.025,0.545c0,0.053,0.042,0.135,0.088,0.21c-0.005,0.059-0.004,0.119-0.009,0.178C27.388,17.153,27.387,17.327,27.436,17.39zM20.382,12.064c0.076,0.05,0.102,0.127,0.152,0.203c0.052,0.076,0.14,0.05,0.203,0.114c0.063,0.064-0.178,0.14-0.075,0.216c0.101,0.077,0.151,0.381,0.165,0.458c0.013,0.076-0.279,0.114-0.369,0.102c-0.089-0.013-0.354-0.102-0.445-0.127c-0.089-0.026-0.139-0.343-0.025-0.331c0.116,0.013,0.141-0.025,0.267-0.139c0.128-0.115-0.189-0.166-0.278-0.191c-0.089-0.025-0.268-0.305-0.331-0.394c-0.062-0.089-0.014-0.228,0.141-0.331c0.076-0.051,0.279,0.063,0.381,0c0.101-0.063,0.203-0.14,0.241-0.165c0.039-0.025,0.293,0.038,0.33,0.114c0.039,0.076,0.191,0.191,0.141,0.229c-0.052,0.038-0.281,0.076-0.356,0c-0.075-0.077-0.255,0.012-0.268,0.152C20.242,12.115,20.307,12.013,20.382,12.064zM16.875,12.28c-0.077-0.025,0.025-0.178,0.102-0.229c0.075-0.051,0.164-0.178,0.241-0.305c0.076-0.127,0.178-0.14,0.241-0.127c0.063,0.013,0.203,0.241,0.241,0.318c0.038,0.076,0.165-0.026,0.217-0.051c0.05-0.025,0.127-0.102,0.14-0.165s0.127-0.102,0.254-0.102s0.013,0.102-0.076,0.127c-0.09,0.025-0.038,0.077,0.113,0.127c0.153,0.051,0.293,0.191,0.459,0.279c0.165,0.089,0.19,0.267,0.088,0.292c-0.101,0.025-0.406,0.051-0.521,0.038c-0.114-0.013-0.254-0.127-0.419-0.153c-0.165-0.025-0.369-0.013-0.433,0.077s-0.292,0.05-0.395,0.05c-0.102,0-0.228,0.127-0.253,0.077C16.875,12.534,16.951,12.306,16.875,12.28zM17.307,9.458c0.063-0.178,0.419,0.038,0.355,0.127C17.599,9.675,17.264,9.579,17.307,9.458zM17.802,18.584c0.063,0.102-0.14,0.431-0.254,0.407c-0.113-0.027-0.076-0.318-0.038-0.382C17.548,18.545,17.769,18.529,17.802,18.584zM13.189,12.674c0.025-0.051-0.039-0.153-0.127-0.013C13.032,12.71,13.164,12.725,13.189,12.674zM20.813,8.035c0.141,0.076,0.339,0.107,0.433,0.013c0.076-0.076,0.013-0.204-0.05-0.216c-0.064-0.013-0.104-0.115,0.062-0.203c0.165-0.089,0.343-0.204,0.534-0.229c0.19-0.025,0.622-0.038,0.774,0c0.152,0.039,0.382-0.166,0.445-0.254s-0.203-0.152-0.279-0.051c-0.077,0.102-0.444,0.076-0.521,0.051c-0.076-0.025-0.686,0.102-0.812,0.102c-0.128,0-0.179,0.152-0.356,0.229c-0.179,0.076-0.42,0.191-0.509,0.229c-0.088,0.038-0.177,0.19-0.101,0.216C20.509,7.947,20.674,7.959,20.813,8.035zM14.142,12.674c0.064-0.089-0.051-0.217-0.114-0.217c-0.12,0-0.178,0.191-0.103,0.254C14.002,12.776,14.078,12.763,14.142,12.674zM14.714,13.017c0.064,0.025,0.114,0.102,0.165,0.114c0.052,0.013,0.217,0,0.167-0.127s-0.167-0.127-0.204-0.127c-0.038,0-0.203-0.038-0.267,0C14.528,12.905,14.65,12.992,14.714,13.017zM11.308,10.958c0.101,0.013,0.217-0.063,0.305-0.101c0.088-0.038,0.216-0.114,0.216-0.229c0-0.114-0.025-0.216-0.077-0.267c-0.051-0.051-0.14-0.064-0.216-0.051c-0.115,0.02-0.127,0.14-0.203,0.14c-0.076,0-0.165,0.025-0.14,0.114s0.077,0.152,0,0.19C11.117,10.793,11.205,10.946,11.308,10.958zM11.931,10.412c0.127,0.051,0.394,0.102,0.292,0.153c-0.102,0.051-0.28,0.19-0.305,0.267s0.216,0.153,0.216,0.153s-0.077,0.089-0.013,0.114c0.063,0.025,0.102-0.089,0.203-0.089c0.101,0,0.304,0.063,0.406,0.063c0.103,0,0.267-0.14,0.254-0.229c-0.013-0.089-0.14-0.229-0.254-0.28c-0.113-0.051-0.241-0.28-0.317-0.331c-0.076-0.051,0.076-0.178-0.013-0.267c-0.09-0.089-0.153-0.076-0.255-0.14c-0.102-0.063-0.191,0.013-0.254,0.089c-0.063,0.076-0.14-0.013-0.217,0.012c-0.102,0.035-0.063,0.166-0.012,0.229C11.714,10.221,11.804,10.361,11.931,10.412zM24.729,17.198c-0.083,0.037-0.153,0.47,0,0.521c0.152,0.052,0.241-0.202,0.191-0.267C24.868,17.39,24.843,17.147,24.729,17.198zM20.114,20.464c-0.159-0.045-0.177,0.166-0.304,0.306c-0.128,0.141-0.267,0.254-0.317,0.241c-0.052-0.013-0.331,0.089-0.242,0.279c0.089,0.191,0.076,0.382-0.013,0.472c-0.089,0.088,0.076,0.342,0.052,0.482c-0.026,0.139,0.037,0.229,0.215,0.229s0.242-0.064,0.318-0.229c0.076-0.166,0.088-0.331,0.164-0.47c0.077-0.141,0.141-0.434,0.179-0.51c0.038-0.075,0.114-0.316,0.102-0.457C20.254,20.669,20.204,20.489,20.114,20.464zM10.391,8.802c-0.069-0.06-0.229-0.102-0.306-0.11c-0.076-0.008-0.152,0.06-0.321,0.06c-0.168,0-0.279,0.067-0.347,0C9.349,8.684,9.068,8.65,9.042,8.692C9.008,8.749,8.941,8.751,9.008,8.87c0.069,0.118,0.12,0.186,0.179,0.178s0.262-0.017,0.288,0.051C9.5,9.167,9.569,9.226,9.712,9.184c0.145-0.042,0.263-0.068,0.296-0.119c0.033-0.051,0.263-0.059,0.263-0.059S10.458,8.861,10.391,8.802z";

            function handleGoHome() {
                map.dataProvider = continentsDataProvider;
                 map.validateNow();
            }
            function writeDevInfo(event) {
             document.getElementById("devInfo").innerHTML = event.str;
              
            }
             var targetSVG = "M9,0C4.029,0,0,4.029,0,9s4.029,9,9,9s9-4.029,9-9S13.971,0,9,0z M9,15.93 c-3.83,0-6.93-3.1-6.93-6.93S5.17,2.07,9,2.07s6.93,3.1,6.93,6.93S12.83,15.93,9,15.93 M12.5,9c0,1.933-1.567,3.5-3.5,3.5S5.5,10.933,5.5,9S7.067,5.5,9,5.5 S12.5,7.067,12.5,9z";
             var targetSVG2="M9.009,0C4.034,0,0,4.032,0,9.01c0,4.977,6.193,16.579,9.009,16.579c2.815,0,9.009-11.604,9.009-16.579 C18.018,4.034,13.984,0,9.009,0z M9.009,15.289c-3.387,0-6.132-2.747-6.132-6.132c0-3.387,2.746-6.132,6.132-6.132 s6.132,2.745,6.132,6.132S12.396,15.289,9.009,15.289z";
 
            AmCharts.ready(function() {
                
                map = new AmCharts.AmMap();
                
               
                
                 var zyDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/zy.svg",
         areas : [{
            id : "1",color : "#ff5003", rollOverColor : rollcolor_red 
        },{
          id : "2",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
        id : "3",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
        id : "4",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
        id : "5",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
         id : "6",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
       id : "7",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
        id : "8",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
       id : "9",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
        id : "10",color : "#ff5003", rollOverColor : rollcolor_red 
            },{
        id : "11",color : "#ff5003", rollOverColor : rollcolor_red 
          },{
        id : "12",color : "#ff5003", rollOverColor : rollcolor_red 
          },{
        id : "13",color : "#ff5003"  , rollOverColor : rollcolor_red 
        }],  
       
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale :2,
            latitude : 86.4859,
            longitude : -162.0199,
            //color : "#fff",
            label:"赤水市",
            title : "赤水市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 72.838,
            longitude : -109.6096,
           //color : "#fff",
            label:"习水县",
            title : "习水县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 45.0127,
            longitude : -31.0286,
            //color : "#fff",
            label:"桐梓县",
            title : "桐梓县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -24.1971,
            longitude : -99.8894,
            //color : "#fff",
            label: "仁怀市",
            title : "仁怀市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -59.316,
            longitude : -33.7301,
            //color : "#fff",
            label:"遵义市",
            title : "遵义市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -75.4906,
            longitude : -53.4409,
           //color : "#fff",
            label:"遵义县",
            title : "遵义县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -22.918,
            longitude : 11.227,
           //color : "#fff",
            label:"绥阳县",
            title : "绥阳县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -68.8386,
            longitude : 44.7667,
           //color : "#fff",
            label:"湄潭县",
            title : "湄潭县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -88.4469,
            longitude : 73.9016,
           //color : "#fff",
            label:"余庆县",
            title : "余庆县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -46.4353,
            longitude : 81.9864,
           //color : "#fff",
            label:"凤冈县",
            title : "凤冈县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 73.2473,
            longitude : 61.4462,
           //color : "#fff",
            label:"正安县",
            title : "正安县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 86.142,
            longitude : 105.073,
           //color : "#fff",
            label: "道真仡佬族苗族自治县",
            title : "道真仡佬族苗族自治县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 56.2091,
            longitude : 129.6806,
            //color : "#fff",
            label:"务川仡佬族苗族自治县",
            title : "务川仡佬族苗族自治县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -62.3752,
            longitude : -33.9764,
           color : "#eeeeee",
            title : "遵义会议会址旅游景区",
            label: "遵义会议会址旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 80.7385,
            longitude : -153.6343,
            color : "#eeeeee",
             label:"赤水大瀑布景区",
            title : "赤水大瀑布景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 84.1617,
            longitude : -155.6241,
            color : "#eeeeee",
             label:"燕子岩国家森林公园 ",
            title : "燕子岩国家森林公园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 86.2933,
            longitude : -162.0199,
            color : "#eeeeee",
             label: "四渡赤水纪念馆",
            title : "四渡赤水纪念馆"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -71.9838,
            longitude : 11.8512,
            color : "#eeeeee",
             label:" 水上大天门旅游景区 （云门囤）",
            title : " 水上大天门旅游景区 （云门囤）"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 77.1889,
            longitude : -97.8301,
            color : "#eeeeee",
             label:"中国丹霞谷旅游风景区",
            title : "中国丹霞谷旅游风景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 13.7576,
            longitude : -22.6427,
            color : "#eeeeee",
             label:"娄山关景区",
            title : "娄山关景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -66.9116,
            longitude : 47.3355,
            color : "#eeeeee", 
            label:"天下第一壶茶文化旅游景区 ",
            title : "天下第一壶茶文化旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 85.1699,
            longitude : -131.7465,
            color : "#eeeeee",
             label:"赤水竹海旅游景区",
            title : "赤水竹海旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -85.496,
            longitude : 60.5369,
            color : "#eeeeee",
             label:"飞龙寨景区",
            title : "飞龙寨景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 82.5139,
            longitude : -130.6095,
            color : "#eeeeee",
             label:"佛光岩景区",
            title : "佛光岩景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -41.0237,
            longitude : 78.4143,
            color : "#eeeeee",
             label:"凤冈茶海之心景区",
            title : "凤冈茶海之心景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -3.551,
            longitude : -99.2347,
            color : "#eeeeee",
             label:"中国酒文化城",
            title : "中国酒文化城"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -3.551,
            longitude : -99.2347,
            color : "#eeeeee",
             label:"中国酒文化城",
            title : "中国酒文化城"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -53.7842,
            longitude : 66.8157,
            color : "#eeeeee",
             label:"湄潭茶海生态园景区",
            title : "湄潭茶海生态园景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 59.5566,
            longitude : 129.8886,
            color : "#eeeeee",
             label:"务川仡佬文化旅游景区",
            title : "务川仡佬文化旅游景区"

        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -71.6158,
            longitude : -72.6589,
            color : "#eeeeee",
             label:"枫香温泉旅游景区 ",
            title : "枫香温泉旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -66.7516,
            longitude : -25.1066,
            color : "#eeeeee",
             label:"遵义动物园 ",
            title : "遵义动物园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 33.541,
            longitude : 37.3983,
            color : "#eeeeee",
             label:"水晶温泉 ",
            title : "水晶温泉 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -65.642,
            longitude : -35.2084,
            color : "#eeeeee",
             label:"湘山寺旅游景区",
            title : "湘山寺旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -23.7202,
            longitude : -105.4539,
            color : "#eeeeee",
             label:"盐津河旅游景区",
            title : "盐津河旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -82.1955,
            longitude : -53.1945,
            color : "#eeeeee",
             label:"乌江渡旅游景区",
            title : "乌江渡旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 44.0918,
            longitude : 1.083,
            color : "#eeeeee",
             label:"观音岩生态景区",
            title : "观音岩生态景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -34.685,
            longitude : 88.4962,
            color : "#eeeeee",
             label:"玛瑙山景区 ",
            title : "玛瑙山景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 39.504,
            longitude : 131.3448,
            color : "#eeeeee",
             label:"洪渡河景区",
            title : "洪渡河景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -87.1533,
            longitude : 60.2069,
            color : "#eeeeee",
             label:"大乌江景区",
            title : "大乌江景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -53.2324,
            longitude : -33.0149,
            color : "#eeeeee",
             label:"光勋生态农业观光园",
            title : "光勋生态农业观光园"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 61.6129,
            longitude : -30.3293,
            color : "#eeeeee",
             label:"九坝镇上天池旅游景区",
            title : "九坝镇上天池旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -50.5584,
            longitude : -76.8474,
            color : "#eeeeee",
             label:"中华仡佬风情园 ",
            title : "中华仡佬风情园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -4.7883,
            longitude : 27.6601,
            color : "#eeeeee",
             label:"红果树生态旅游景区",
            title : "红果树生态旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -30.4516,
            longitude : -102.6716,
            color : "#eeeeee",
             label:"中国酒都酱酒文化纪念馆",
            title : "中国酒都酱酒文化纪念馆"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -70.5984,
            longitude : -42.1071,
            color : "#eeeeee",
             label:"乡韵庄园",
            title : "乡韵庄园"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -72.2253,
            longitude : -43.0927,
            color : "#eeeeee",
             label:"黔北记忆旅游文化产业园",
            title : "黔北记忆旅游文化产业园"
        }]
    };
    
     
    

    var trDataProvider = {
        //mapVar : AmCharts.maps.guiZhou,
        mapURL : "view/ammap/maps/tr.svg",
        areas : [{
            id : "1",            color : "#fed30d",rollOverColor : rollcolor_yellow
        },{
        id : "2",            color : "#fed30d",rollOverColor : rollcolor_yellow         
           },{
        id : "3",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "4",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "5",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "6",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "7",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "8",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "9",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "10",            color : "#fed30d",rollOverColor : rollcolor_yellow
            
        }],  
       
        getAreasFromMap : false,
        images : [{
            svgPath : targetSVG,scale :2,
            latitude : 74.6363,
            longitude : 36.1331,
            //color : "#FFF",
            label:"沿江土家族自治县",
            title : "沿江土家族自治县"
            
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 46.3566,
            longitude : -64.954,
            //color : "#ffffff",
            label:"德江县",
            title : "德江县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -22.3185,
            longitude : -22.8587,
            //color : "#ffffff",
             label:"印江土家族苗族自治县",
            title : "印江土家族苗族自治县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -22.3185,
            longitude : -60.4881,
            //color : "#fff",
             label:"思南县",
            title : "思南县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -78.026,
            longitude : -80.3291,
            //color : "#fff",
             label:"石阡县",
            title : "石阡县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -73.2016,
            longitude : 38.7166,
            //color : "#fff",
             label:"江口县",
            title : "江口县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -77.0504,
            longitude : 122.8697,
            //color : "#fff",
               label:"铜仁市",
            title : "铜仁市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -85.6956,
            longitude : 106.4496,
            //color : "#fff",
               label:"万山特区",
            title : "万山特区"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -88.0447,
            longitude : 34.6116,
            //color : "#fff",
               label:"玉屏侗族自治区",
            title : "玉屏侗族自治区"
        }, {
            svgPath : targetSVG,scale :1,
            latitude : -15.9119,
            longitude : 133.1322,
            //color : "#fff",
             label:"松桃苗族自治县",
            title : "松桃苗族自治县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -43.5958,
            longitude : 15.4548,
            color : "#eeeeee",
            title : "梵净山",
             label : "梵净山"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -79.2149,
            longitude : 123.5538,
            color : "#eeeeee",
            title : " 大明边城景区 ",
             label: " 大明边城景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -74.4605,
            longitude : -66.6457,
            color : "#eeeeee",
            title: "石阡夜郎古泉旅游景区",
            label:" 石阡夜郎古泉旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -74.0514,
            longitude : 130.3955,
            color : "#eeeeee",
            title : " 九龙洞旅游景区 ",
             label:" 九龙洞旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -13.7256,
            longitude : -80.3291,
            color : "#eeeeee",
            title : "思南温泉-石林旅游景区 ",
            label : "思南温泉-石林旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -84.8936,
            longitude : 103.7129,
            color : "#eeeeee",
            title : "矿山公园旅游景区  ",
            label : "矿山公园旅游景区  "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -67.9708,
            longitude : 131.7639,
            color : "#eeeeee",
            title : "松桃苗王城旅游景区",
            label : "松桃苗王城旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -65.905,
            longitude : 32.5591,
            color : "#eeeeee",
            title : "亚木沟生态旅游区",
            label:"亚木沟生态旅游区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -81.2534,
            longitude : -84.4341,
            color : "#eeeeee",
            title : "尧上旅游景区  ",
            label:"尧上旅游景区  "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -70.3803,
            longitude : 35.2958,
            color : "#eeeeee",
            title : "云舍旅游景区 ",
            label:"云舍旅游景区 "

        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -75.055,
            longitude : 107.8179,
            color : "#eeeeee",
            title : "云林仙境景区 ",
            label:"云林仙境景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -79.355,
            longitude : -96.7492,
            color : "#eeeeee",
            title : "楼上旅游景区 ",
            label:"楼上旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -61.5787,
            longitude : -65.9615,
            color : "#eeeeee",
            title : "郝家湾旅游景区 ",
            label:"郝家湾旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 76.2041,
            longitude : 42.5453,
            color : "#eeeeee",
            title : "南庄旅游景区 ",
            label:"南庄旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -29.105,
            longitude : 6.5606,
            color : "#eeeeee",
            title : "团龙旅游景区",
            label:"团龙旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -59.7321,
            longitude : 47.6109,
            color : "#eeeeee",
            title : "江口寨沙侗寨旅游景区",
            label:"江口寨沙侗寨旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -87.4895,
            longitude : 41.4533,
            color : "#eeeeee",
            title : "茶花泉旅游景区",
            label:"茶花泉旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 33.1263,
            longitude : -81.6974,
            color : "#eeeeee",
            title : "德江高家湾高效农业旅游景区",
            label:"德江高家湾高效农业旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -79.355,
            longitude : -42.0155,
            color : "#eeeeee",
            title : "石阡五德桃源旅游景区",
            label:"石阡五德桃源旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -87.5547,
            longitude : 51.0317,
            color : "#eeeeee",
            title : "铜仁市玉屏屏山旅游景区 ",
            label:"铜仁市玉屏屏山旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -76.5337,
            longitude : 7.9289,
            color : "#eeeeee",
            title : "江口鱼粮农业公园旅游景区",
            label:"江口鱼粮农业公园旅游景区"

        }]
    };

    var asDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/as.svg",
        areas : [{
            id : "1",color : "#ff5003",rollOverColor : rollcolor_red 
        },{
          id : "2",color : "#ff5003",rollOverColor : rollcolor_red 
            },{
        id : "3",color : "#ff5003",rollOverColor : rollcolor_red 
            },{
        id : "4",color : "#ff5003",rollOverColor : rollcolor_red 
            },{
        id : "5",color : "#ff5003",rollOverColor : rollcolor_red 
       
        }],  
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale :2,
            latitude : 79.1061,
            longitude : -21.7415,
             //color : "#fff",
             label:"普定县",
            title : "普定县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 79.3979,
            longitude : 123.5907,
            // color : "#fff",
             label:"平坝县",
            title : "平坝县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 76.4135,
            longitude : 36.9731,
            //color : "#fff",
             label:"安顺市",
            title : "安顺市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 63.0904,
            longitude : -34.9358,
            //color : "#fff",
             label: "镇宁布依族苗族自治县",
            title : "镇宁布依族苗族自治县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 53.7397,
            longitude : -88.3227,
            //color : "#fff",
             label: "关岭布依族苗族自治县",
            title : "关岭布依族苗族自治县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 14.8565,
            longitude : 17.9064,
            //color : "#fff",
             label:"紫云布依族苗族自治县",
            title : "紫云布依族苗族自治县"
        }, {
            svgPath : targetSVG2,scale :1,
            latitude : 57.8526,
            longitude : -44.7415,
            color : "#eeeeee",
            title : "黄果树瀑布",
            label: "黄果树瀑布"
        }, {
            svgPath : targetSVG2,scale :1,
            latitude : 65.2645,
            longitude : 12.4587,
            color : "#eeeeee",
            title : "龙宫风景名胜区",
            label: "龙宫风景名胜区"
        }, {
            svgPath : targetSVG2,scale :1,
            latitude : 67.3745,
            longitude : -51.308,
            color : "#eeeeee",
            title : "夜郎洞景区",
            label:"夜郎洞景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 75.5258,
            longitude : 31.5255,
            color : "#eeeeee",
            title : "兴伟石博园",
            label: "兴伟石博园"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 77.0252,
            longitude : 89.8153,
            color : "#eeeeee",
            title : "旧州生态文化旅游古镇 ",
            label:  "旧州生态文化旅游古镇 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 73.0029,
            longitude : 104.5239,
            color : "#eeeeee",
            title : "云峰八寨文化旅游区",
            label:"云峰八寨文化旅游区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 8.6665,
            longitude : 40.7865,
            color : "#eeeeee",
            title : "紫云格凸河户外休闲旅游景区",
            label: "紫云格凸河户外休闲旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 74.9875,
            longitude : 29.4374,
            color : "#eeeeee",
            title : "贵州多彩万象旅游综合体",
            label: "贵州多彩万象旅游综合体"

        }]
    };

    var bjDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/bj.svg",
         areas : [{
            id : "1",color : "#71ba2d",rollOverColor : rollcolor_green
        },{
          id : "2",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "3",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "4",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "5",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
         id : "6",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
       id : "7",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "8",color : "#71ba2d",rollOverColor : rollcolor_green
            
        }],  
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale : 2,
            latitude : 53.1563,
            longitude : -92.6181,
             //color : "#fff",
            label:"威宁彝族回族苗族自治县",
            title : "威宁彝族回族苗族自治县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 63.9012,
            longitude : -46.6167,
            //color : "#fff",
            label:"赫章县",
            title : "赫章县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 70.6601,
            longitude : 27.4533,
            //color : "#fff",
            label:"毕节市",
            title : "毕节市"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 6.9407,
            longitude : 16.0179,
             //color : "#fff",
            label:"纳雍县",
            title : "纳雍县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 48.8003,
            longitude : 51.1037,
            //color : "#fff",
            label: "大方县",
            title : "大方县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : -11.844,
            longitude : 57.0813,
            //color : "#fff",
            label:"织金县",
            title : "织金县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 25.2955,
            longitude : 94.766,
             //color : "#fff",
            label:"黔西县",
            title : "黔西县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 64.1768,
            longitude : 128.8123,
             //color : "#fff",
            label:"金沙县",
            title : "金沙县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 39.2274,
            longitude : 89.2085,
            color : "#eeeeee",
            title : "百里杜鹃风景名胜区",
            label:"百里杜鹃风景名胜区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 57.4515,
            longitude : -94.6973,
            color : "#eeeeee",
            title : "草海",
            label:"草海"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 5.4104,
            longitude : 68.5917,
            color : "#eeeeee",
            title : "织金洞风景区",
            label:"织金洞风景区"

        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 72.3229,
            longitude : 32.8559,
            color : "#eeeeee",
            title : "泰丰农业生态植物观光园 ",
            label:"泰丰农业生态植物观光园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 65.8357,
            longitude : -3.9795,
            color : "#eeeeee",
            title : "毕节市国家森林公园拱拢坪景区",
            label:"毕节市国家森林公园拱拢坪景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 61.0876,
            longitude : 144.4615,
            color : "#eeeeee",
            title : "金沙温泉",
            label:"金沙温泉"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -6.884,
            longitude : 57.0463,
            color : "#eeeeee",
            title : "桂果旅游区",
            label:"桂果旅游区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 58.9248,
            longitude : 87.5591,
            color : "#eeeeee",
            title : "米底河景区",
            label:"米底河景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 54.548,
            longitude : 49.6242,
            color : "#eeeeee",
            title : "慕俄格古城",
            label:"慕俄格古城"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 67.42,
            longitude : 39.4533,
            color : "#eeeeee",
            title : "七星关小河旅游区",
            label:"七星关小河旅游区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 53.1736,
            longitude : 71.0657,
            color : "#eeeeee",
            title : "油杉河景区",
            label:"油杉河景区" 
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 60.6847,
            longitude : -86.3806,
            color : "#eeeeee",
            title : "泰丰现代农业科技示范园",
            label:"泰丰现代农业科技示范园"
        }]
    };

    var gyDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/gy.svg",
         areas : [{
            id : "1",color : "#cc67db",rollOverColor : rollcolor_purple
        },{
          id : "2",color : "#cc67db",rollOverColor : rollcolor_purple
            },{
        id : "3",color : "#cc67db",rollOverColor : rollcolor_purple
            },{
        id : "4",color : "#cc67db",rollOverColor : rollcolor_purple
            },{
        id : "5",color : "#cc67db" ,rollOverColor : rollcolor_purple
        }],  
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale : 2,
            latitude : 25.182,
            longitude : -95.9352,
            //color : "#fff",
            label:"清镇市",
            title : "清镇市"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 27.5785,
            longitude : -25.1937,
            //color : "#fff",
            label:"贵阳市",
            title : "贵阳市"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 57.6926,
            longitude : -31.5808,
            //color : "#fff",
            label: "修文县",
            title : "修文县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 71.1714,
            longitude : 78.5965,
            //color : "#fff",
            label:"开阳县",
            title : "开阳县"
        }, {
            svgPath : targetSVG,scale : 2,
            latitude : 74.8535,
            longitude : 41.3385,
            //color : "#fff",
            label:"息烽县",
            title : "息烽县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -30.0701,
            longitude : -20.4033,
            color : "#eeeeee",
            title : "青岩古镇",
            label:"青岩古镇"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 18.3967,
            longitude : -14.5485,
            color : "#eeeeee",
            description:jq_qialingshan,
            title : "黔灵山公园旅游景区",
            label: "黔灵山公园旅游景区"
            
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 21.2874,
            longitude : -118.7319,
            color : "#eeeeee",
            title : "红枫湖旅游风景区",
            label:"红枫湖旅游风景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -10.1911,
            longitude : -74.1613,
            color : "#eeeeee",
            title : "天河潭景区",
            label: "天河潭景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 60.7567,
            longitude : 5.6773,
            color : "#eeeeee",
            title : " 贵阳市野生动物园 ",
            label:" 贵阳市野生动物园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 29.3348,
            longitude : 20.0482,
            color : "#eeeeee",
            title : " 贵阳市保利国际温泉",
            label:" 贵阳市保利国际温泉"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 63.2964,
            longitude : 90.5615,
            color : "#eeeeee",
            title : " 南江大峡谷景区",
            label:" 南江大峡谷景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 23.6771,
            longitude : 21.645,
            color : "#eeeeee",
            title : "贵阳市天邑温泉景区",
            label:"贵阳市天邑温泉景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 34.421,
            longitude : 40.274,
            color : "#eeeeee",
            title : "贵阳市贵御温泉旅游景区",
            label:"贵阳市贵御温泉旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 64.5729,
            longitude : 18.9837,
            color : "#eeeeee",
            title : "桃源河旅游景区",
            label:"桃源河旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 68.4155,
            longitude : 32.8224,
            color : "#eeeeee",
            title : "白马峪旅游景区",
            label:"白马峪旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -6.2375,
            longitude : -18.8066,
            color : "#eeeeee",
            title : "湿地公园景区（孔学堂）",
            label:"湿地公园景区（孔学堂）"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 71.5965,
            longitude : 38.145,
            color : "#eeeeee",
            title : "息烽集中营革命历史纪念馆景区",
            label:"息烽集中营革命历史纪念馆景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 52.7157,
            longitude : 23.497,
            color : "#eeeeee",
            title : "蓬莱仙界·白云休闲农业旅游景区",
            label: "蓬莱仙界·白云休闲农业旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 14.3287,
            longitude : -55.011,
            color : "#eeeeee",
            title : "阿哈湖湿地公园景区",
            label:"阿哈湖湿地公园景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 5.1553,
            longitude : 8.8641,
            color : "#eeeeee",
            title : "多彩贵州城旅游综合体",
            label:"多彩贵州城旅游综合体"

        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 11.9741,
            longitude : 12.5966,
            color : "#eeeeee",
            title : "贵阳市森林公园 ",
            label:"贵阳市森林公园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 11.6482,
            longitude : -12.4195,
            color : "#eeeeee",
            title : "贵阳市河滨公园 ",
            label:"贵阳市河滨公园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 42.7335,
            longitude : -36.3711,
            color : "#eeeeee",
            title : "贵阳市白云公园 ",
            label:"贵阳市白云公园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 14.8883,
            longitude : 7.274,
            color : "#eeeeee",
            title : "贵阳市甲秀楼景区 ",
            label:"贵阳市甲秀楼景区 "

        }]
    };

    var lpsDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/lps.svg",
         areas : [{
            id : "1",            color : "#fed30d",rollOverColor : rollcolor_yellow
        },{
        id : "2",            color : "#fed30d",rollOverColor : rollcolor_yellow         
           },{
        id : "3",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "4",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "5",            color : "#fed30d",rollOverColor : rollcolor_yellow
         
        }],  
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale :2,
            latitude : 75.0671,
            longitude : 25.8988,
            //color : "#fff",
            label: "六盘水市",
            title : "六盘水市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 1.8975,
            longitude : -109.5639,
            //color : "#fff",
            label: "盘县",
            title : "盘县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 31.7635,
            longitude : 143.9626,
           //color : "#fff",
            label:"六枝特区",
            title : "六枝特区"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 62.8742,
            longitude : 24.0346,
            //color : "#fff",
            label: "水城县",
            title : "水城县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 62.679,
            longitude : -1.252,
            color : "#eeeeee",
            title : "玉舍森林旅游景区",
            label:"玉舍森林旅游景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -6.0814,
            longitude : -56.1245,
            color : "#eeeeee",
            title : "娘娘山旅游景区",
            label:"娘娘山旅游景区"
        }]
    };

    var qdnDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/qdn.svg",
         areas : [{
            id : "1",color : "#71ba2d",rollOverColor : rollcolor_green
        },{
          id : "2",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "3",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "4",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "5",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
         id : "6",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
       id : "7",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "8",color : "#71ba2d",rollOverColor : rollcolor_green        
           },{
        id : "9",color : "#71ba2d",rollOverColor : rollcolor_green
           },{
        id : "10",color : "#71ba2d",rollOverColor : rollcolor_green
           },{
        id : "11",color : "#71ba2d",rollOverColor : rollcolor_green
           },{
        id : "12",color : "#71ba2d",rollOverColor : rollcolor_green
           },{
        id : "13",color : "#71ba2d",rollOverColor : rollcolor_green
           },{
        id : "14",color : "#71ba2d",rollOverColor : rollcolor_green
           },{
        id : "15",color : "#71ba2d",rollOverColor : rollcolor_green
           },{
        id : "16",color : "#71ba2d",rollOverColor : rollcolor_green
          
        }],  
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale :2,
            latitude : -26.5137,
            longitude : 32.0961,
            //color : "#fff",
            label:"从江县",
            title : "从江县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 12.4542,
            longitude : 99.278,
            // color : "#fff",
            label:"黎平县",
            title : "黎平县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -0.1966,
            longitude : -15.354,
           // color : "#fff",
            label:"榕江县",
            title : "榕江县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 53.0007,
            longitude : 122.0929,
            // color : "#fff",
            label:"锦屏县",
            title : "锦屏县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 56.4587,
            longitude : 30.2762,
            // color : "#fff",
            label:"剑河县",
            title : "剑河县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 64.3116,
            longitude : -11.4587,
           //  color : "#fff",
            label:"台江县",
            title : "台江县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 49.2418,
            longitude : -61.5406,
           // color : "#fff",
            label:"雷山县",
            title : "雷山县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 40.0314,
            longitude : -107.1707,
            // color : "#fff",
            label: "丹寨县",
            title : "丹寨县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 61.1094,
            longitude : -122.1952,
            // color : "#fff",
            label:"麻江县",
            title : "麻江县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 62.6776,
            longitude : -62.097,
           // color : "#fff",
            label: "凯里市",
            title : "凯里市"
        }, {
            svgPath : targetSVG,scale :1,
            latitude : 75.4658,
            longitude : -67.1052,
            // color : "#fff",
            label:"黄平县",
            title : "黄平县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 77.912,
            longitude : -23.7009,
           //  color : "#fff",
            label:"施秉县",
            title : "施秉县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 77.1206,
            longitude : 23.5986,
           // color : "#fff",
            label:"镇远县",
            title : "镇远县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 71.8244,
            longitude : 58.6559,
             //color : "#fff",
            label:"三穗县",
            title : "三穗县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 65.9899,
            longitude : 140.4562,
           // color : "#fff",
            label: "天柱县",
            title : "天柱县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 79.5367,
            longitude : 70.3416,
            //color : "#fff",
            label:"岑巩县",
            title : "岑巩县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 75.9588,
            longitude : 23.5986,
            color : "#eeeeee",
            title : "镇远古镇",
            label:"镇远古镇"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 53.991,
            longitude : -50.4113,
            color : "#eeeeee",
            title : " 西江千户苗寨景区 ",
            label:" 西江千户苗寨景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 79.4761,
            longitude : -23.7009,
            color : "#eeeeee",
            title : "云台山旅游景区  ",
            label:"云台山旅游景区  "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -7.1697,
            longitude : 72.5675,
            color : "#eeeeee",
            title : "黎平肇兴侗文化旅游景区 ",
            label:"黎平肇兴侗文化旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 81.7906,
            longitude : -30.8795,
            color : "#eeeeee",
            title : "杉木河景区 ",
            label:"杉木河景区 "

        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 74.067,
            longitude : -79.9039,
            color : "#eeeeee",
            title : "野洞河旅游景区 ",
            label:"野洞河旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 77.4446,
            longitude : 23.0965,
            color : "#eeeeee",
            title : "青龙洞景区 ",
            label:"青龙洞景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 60.4594,
            longitude : -61.5406,
            color : "#eeeeee",
            title : "凯里苗侗风情园景区 ",
            label: "凯里苗侗风情园景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 65.7175,
            longitude : -59.8712,
            color : "#eeeeee",
            title : "云谷田园生态农业旅游综合体 ",
            label:"云谷田园生态农业旅游综合体 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 57.9021,
            longitude : -103.2754,
            color : "#eeeeee",
            title : "苗妹非遗博物馆 ",
            label:"苗妹非遗博物馆 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 61.2699,
            longitude : -95.4849,
            color : "#eeeeee",
            title : "下司古镇 ",
            label:"下司古镇 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 57.9021,
            longitude : -104.3884,
            color : "#eeeeee",
            title : "麻江蓝莓生态旅游区 ",
            label:"麻江蓝莓生态旅游区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 76.1991,
            longitude : -68.2181,
            color : "#eeeeee",
            title : "黄平旧州古城旅游景区 ",
            label:"黄平旧州古城旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 70.2004,
            longitude : 51.4218,
            color : "#eeeeee",
            title : "颇洞农业体验园区",
            label:"颇洞农业体验园区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 42.0403,
            longitude : 104.286,
            color : "#eeeeee",
            title : "隆里古城旅游景区 ",
            label:"隆里古城旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 15.5889,
            longitude : 99.2778,
            color : "#eeeeee",
            title : "翘街旅游景区 ",
            label:"翘街旅游景区 "

        }]
    };

    var qnDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/qn.svg",
         areas : [{
            id : "1",            color : "#fed30d",rollOverColor : rollcolor_yellow
        },{
        id : "2",            color : "#fed30d",rollOverColor : rollcolor_yellow         
           },{
        id : "3",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "4",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "5",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "6",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "7",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "8",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "9",            color : "#fed30d",rollOverColor : rollcolor_yellow
            },{
        id : "10",            color : "#fed30d",rollOverColor : rollcolor_yellow
             },{
        id : "11",            color : "#fed30d",rollOverColor : rollcolor_yellow
         },{
        id : "12",            color : "#fed30d",rollOverColor : rollcolor_yellow
        }],  
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale :2,
            latitude : -39.2025,
            longitude : 94.5102,
            //color : "#fff",
            label:"荔波县",
            title : "荔波县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 3.6009,
            longitude : 64.9948,
             //color : "#fff",
            label:"独山县",
            title : "独山县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 14.1127,
            longitude : 119.2208,
              //color : "#fff",
            label:"三都水族自治县",
            title : "三都水族自治县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 41.1471,
            longitude : 75.2909,
             // color : "#fff",
            label:"都匀市",
            title : "都匀市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 8.5654,
            longitude : 18.3192,
             //color : "#fff",
            label:"平塘县",
            title : "平塘县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -18.0643,
            longitude : -103.1746,
            // color : "#fff",
            label:"罗甸县",
            title : "罗甸县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 42.9387,
            longitude : -119.9259,
             //color : "#fff",
            label:"长顺县",
            title : "长顺县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 45.504,
            longitude : -64.7358,
            // color : "#fff",
            label:"惠水县",
            title : "惠水县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 58.5009,
            longitude : -9.137,
             // color : "#fff",
            label:"龙里县",
            title : "龙里县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 63.1946,
            longitude : 40.9706,
            //color : "#fff",
            label:"贵定县",
            title : "贵定县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 67.1045,
            longitude : 94.5102,
             //color : "#fff",
            label: "福泉市",
            title : "福泉市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 77.444,
            longitude : 106.1791,
            //  color : "#fff",
            label: "瓮安县",
            title : "瓮安县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -51.0977,
            longitude : 83.1267,
            color : "#eeeeee",
            title : "荔波樟江景区",
            label:"荔波樟江景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 22.3268,
            longitude : -6.3914,
            color : "#eeeeee",
            title : "黔南州平塘掌布“藏字石”景区",
            label:"黔南州平塘掌布“藏字石”景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 79.1934,
            longitude : 126.7713,
            color : "#eeeeee",
            title : "草塘千年古邑旅游区",
            label:"草塘千年古邑旅游区"

        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 38.3315,
            longitude : 75.2909,
            color : "#eeeeee",
            title : "西山公园",
            label:"西山公园"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 35.9431,
            longitude : 77.3501,
            color : "#eeeeee",
            title : "文峰园",
            label: "文峰园"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 48.0448,
            longitude : -130.4026,
            color : "#eeeeee",
            title : "杜鹃湖",
            label:"杜鹃湖"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 62.1243,
            longitude : 27.2425,
            color : "#eeeeee",
            title : "金海雪山景区",
            label:"金海雪山景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 47.3398,
            longitude : 62.2492,
            color : "#eeeeee",
            title : "斗篷山风景名胜区 ",
            label:"斗篷山风景名胜区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 1.2726,
            longitude : 55.3851,
            color : "#eeeeee",
            title : "翠泉国家森林公园 ",
            label:"翠泉国家森林公园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 59.1899,
            longitude : -26.9835,
            color : "#eeeeee",
            title : "龙架山森林公园 ",
            label:"龙架山森林公园 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 1.2726,
            longitude : 121.28,
            color : "#eeeeee",
            title : "姑鲁产蛋崖旅游景区 ",
            label:"姑鲁产蛋崖旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : -44.8834,
            longitude : 88.3326,
            color : "#eeeeee",
            title : "瑶山古寨  ",
            label: "瑶山古寨  "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 48.0124,
            longitude : -61.9902,
            color : "#eeeeee",
            title : "连江公园景区  ",
            label:"连江公园景区  "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 76.3108,
            longitude : 133.6353,
            color : "#eeeeee",
            title : "朱家山景区  ",
            label:"朱家山景区  "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 38.852,
            longitude : -73.6591,
            color : "#eeeeee",
            title : "好花红乡村旅游区  ",
            label:"好花红乡村旅游区  "
        }]
    };

    var qxnDataProvider = {
        //mapVar : AmCharts.maps.chinaLow,
        mapURL : "view/ammap/maps/qxn.svg",
         areas : [{
            id : "1",color : "#71ba2d",rollOverColor : rollcolor_green
        },{
          id : "2",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "3",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "4",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "5",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
         id : "6",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
       id : "7",color : "#71ba2d",rollOverColor : rollcolor_green
            },{
        id : "8",color : "#71ba2d",rollOverColor : rollcolor_green        
      
        }],  
        getAreasFromMap : true,
        images : [{
            svgPath : targetSVG,scale :2,
            latitude : -14.8765,
            longitude : 58.6808,
            //color : "#fff",
            label:"册亨县",
            title : "册亨县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : -2.0611,
            longitude : 110.9212,
            //color : "#fff",
            label:"望谟县",
            title : "望谟县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 39.878,
            longitude : 50.6801,
            //color : "#fff",
            label: "贞丰县",
            title : "贞丰县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 11.8372,
            longitude : -0.1484,
            //color : "#fff",
            label:"安龙县",
            title : "安龙县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 27.7495,
            longitude : -97.5696,
            //color : "#fff",
            label: "兴义市",
            title : "兴义市"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 55.4142,
            longitude : -24.1507,
            // color : "#fff",
            label: "兴仁县",
            title : "兴仁县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 75.3314,
            longitude : -0.619,
            //color : "#fff",
            label:"晴隆县",
            title : "晴隆县"
        }, {
            svgPath : targetSVG,scale :2,
            latitude : 76.3623,
            longitude : -50.7609,
            //color : "#fff",
            label:"普安县",
            title : "普安县"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 0.935,
            longitude : -79.6855,
            color : "#eeeeee",
            title : "万峰林万峰湖风景区",
            label:"万峰林万峰湖风景区"
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 33.7536,
            longitude : -66.0371,
            color : "#eeeeee",
            title : "马岭河峡谷旅游景区 ",
            label:"马岭河峡谷旅游景区 "
        }, {
            svgPath : targetSVG2,scale : 1,
            latitude : 54.069,
            longitude : 53.0332,
            color : "#eeeeee",
            title : "双乳峰景区 ",
            label:"双乳峰景区 "
        }]
    };
               
                
                
                continentsDataProvider = {
                      mapVar : AmCharts.maps.guiZhou,
                     // mapURL: "../ammap/maps/xian.svg",
                    //mapURL: "../ammap/maps/qxn.svg",
                    areas : [{
                        id : "zy",
                        color:"#ff5003",
                        //rollOverColor : "#000",
                         linkToObject : zyDataProvider,
                        passZoomValuesToTarget : false
                    },{
                        id : "tr",
                         linkToObject : trDataProvider,
                        color : "#fed30d",
                         passZoomValuesToTarget : false
                       },{
                        id : "qdn",
                         linkToObject : qdnDataProvider,
                        color : "#71ba2d",
                         passZoomValuesToTarget : false
                          },{
                        id : "qn",
                         linkToObject : qnDataProvider,
                        color : "#fed30d",
                         passZoomValuesToTarget : false
                          },{
                        id : "gy",
                          linkToObject : gyDataProvider,
                        color : "#cc67db",
                         passZoomValuesToTarget : false
                          },{
                        id : "bj",
                         linkToObject : bjDataProvider,
                        color : "#71ba2d",
                         passZoomValuesToTarget : false
                          },{
                        id : "as",
                         linkToObject :asDataProvider,
                        color : "#ff5003",
                         passZoomValuesToTarget : false   
                          },{
                        id : "qxn",
                         linkToObject : qxnDataProvider,
                        color : "#71ba2d",
                         passZoomValuesToTarget : false 
                         }, {
                       id : "lps",
                        linkToObject : lpsDataProvider,
                        color : "#fed30d",
                         passZoomValuesToTarget : false
                          
                          
                    }],
                    images : [{
                    svgPath: targetSVG,scale: 2,
                    ////zoomLevel: 5,                    
                     //title: "标题",
                    description:gy_t,
                    latitude:35.4813, 
                    longitude:17.6701,
                    //color: "#eeeeee",                        
                    label: "贵阳市",
                    //labelShiftY: 1,  
                      
                }, {
                    svgPath: targetSVG,scale: 2,
                    //zoomLevel: 5,
                     
                    description:zy_t,
                    label:"遵义市",
                    latitude:65.9039, 
                    longitude:29.4964
                }, {
                    //svgPath: targetSVG,
                    //zoomLevel: 5,
                    scale: 2,
                    description:tr_t,
                    label:"铜仁地区",
                    latitude:67.6112, longitude:116.3354
                }, {
                     svgPath: targetSVG,                
                    scale: 2,
                    description:tr_t,
                    label:"铜仁市",
                   latitude:66.3245, longitude:165.2316
                }, {
                    //svgPath: targetSVG,
                    //zoomLevel: 5,
                   scale: 2,
                    description:qdn_t,
                    label:"黔东南苗族侗族自治州",
                    latitude:16.6655, longitude:99.0663
                   
                }, {
                     svgPath: targetSVG,                   
                   scale: 2,
                    description:qdn_t,
                    label:"凯里市",
                    latitude:29.0054, longitude:95.4644
                   
                }, {
                    //svgPath: targetSVG,
                    //zoomLevel: 5,
                    scale: 2,
                    description:qn_t,
                    label:"黔南布依族苗族自治州",
                   latitude:-6.0565, longitude:16.1745
                    
                }, {
               svgPath: targetSVG,
                   
                    scale: 2,
                    description:qn_t,
                    label:"都匀市",
                  latitude:13.425, longitude:62.3077
                    
                }, {
                    //svgPath: targetSVG,
                    //zoomLevel: 5,
                    scale: 2,
                    description:qxn_t,
                    label:"黔西南布依苗族自治州",
                   latitude:-28.314, longitude:-85.96
                    }, {
                   svgPath: targetSVG,
                 
                    scale: 2,
                    description:qxn_t,
                    label:"兴义市",
                   latitude:-37.5126, longitude:-88.279
                    }, {
                    svgPath: targetSVG,scale: 2,
                    //zoomLevel: 5,
                     
                    label:"六盘水市",
                    description:lps_t,
                    latitude:30.0713, longitude:-95.828
                     }, {
                    //svgPath: targetSVG,
                    //zoomLevel: 5,
                    scale: 2,
                    label:"毕节地区",
                    description:bj_t,
                    latitude:50.1818, longitude:-101.2555
                     }, {
                    svgPath: targetSVG,
                    //zoomLevel: 5,
                    scale: 2,
                    label:"毕节市",
                    description:bj_t,
                    latitude:55.3172, longitude:-67.556
                     }, {
                     svgPath: targetSVG,scale: 2,
                    //zoomLevel: 5,                                   
                    label:"安顺市",
                    description:as_t,
                     //url:"contentlist.html",
                   //labelPosition:top,
                   labelColor: "#fff",
                   //labelFontSize:16,                  
                   latitude:16.6655, longitude:-29.2186
                }]
                };
               
               
                map.dragMap = true;
                map.color = "#FF0000";

          
                
                map.imagesSettings={
            		rollOverColor: "#000",
            		rollOverScale: 1,
            		//selectedScale: 1,
            		selectedColor: "#000",
            		
            	   labelColor: "#fff",
                   labelFontSize:20,
                   labelRollOverColor:"#000",
                   descriptionWindowWidth:500,
                   descriptionWindowX:100,
                   descriptionWindowY:200,
                   //color:"#ff0000"
            	}; 
               map.areasSettings = {
                    autoZoom :false,
                     rollOverOutlineColor : "#000000",
                     //selectedColor : "#3fc35f",
                    //selectedColor : "#ffffff",
                    //rollOverColor : "#6caeff",
                    outlineAlpha : 1,
                    outlineColor : "#fff",
                    outlineThickness : 2,
                    //color : "#EEE"
                };
                
                
                map.defs= {
		            filter:[	{
				                "id": "shadow",
				                "width": "150%",
				                "height": "150%",
				                "feOffset": {
				                  "result": "offOut",
				                  "in": "SourceAlpha",
				                  "dx": "5",
				                  "dy": "5"
				                },
				                "feGaussianBlur": {
				                  "result": "blurOut",
				                  "in": "offOut",
				                  "stdDeviation": "5"
				                },
				                "feBlend": {
				                  "in": "SourceGraphic",
				                  "in2": "blurOut",
				                  "mode": "normal"
				                }
				              }
				            ]
				        };  
                var zoomControl = map.zoomControl;
                zoomControl.panControlEnabled = false;
                zoomControl.zoomControlEnabled = true;
                
                 
                map.addListener("homeButtonClicked", handleGoHome);
                map.dataProvider = continentsDataProvider;
                 
                map.write("mapdiv");

            });

 